Autodesk.Revit.DB.FittingAngleUsage
Since:
2014
An enumerated type representing the options for how to limit the angle values applicable to fitting content.
Since:
2014

Autodesk.Revit.DB.FittingAngleUsage.UseSpecificAngles
Uses only the angles specified.

Autodesk.Revit.DB.FittingAngleUsage.UseAnAngleIncrement
Uses the increment to determine the angle value.

Autodesk.Revit.DB.FittingAngleUsage.UseAnyAngle
Uses any angle supported by fitting content.